FemDesign.Calculate.Freq
fdscript.xsd
ANALFREQ

FemDesign.Calculate.Freq.#ctor
Parameterless constructor for serialization.

FemDesign.Calculate.Freq.#ctor(System.Int32,System.Int32,System.Boolean,System.Boolean,System.Boolean,System.Double)
Define calculation parameters for an eigenfrequency calculation.
numShapes: Number of shapes.
maxSturm: Max number of Sturm check steps (checking missing eigenvalues).
x: Consider masses in global x-direction.
y: Consider masses in global y-direction.
z: Consider masses in global z-direction.
top: Top of substructure. Masses on this level and below are not considered in Eigenfrequency calculation.

FemDesign.Calculate.Freq.Default
Define default calculation parameters for an eigenfrequency calculation.
Returns: